SamiBenNjima/BeFine/ESP-IDF/sdkconfig.defaults
# ─────────────────────────────────────────────────────────────────────────────
# BeFine — sdkconfig.defaults
# Applied automatically by idf.py before menuconfig.
# Override locally with sdkconfig.defaults.local (gitignored).
# ─────────────────────────────────────────────────────────────────────────────

# Target
CONFIG_IDF_TARGET="esp32s3"

# CPU & Memory
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y

# Bluetooth — Bluedroid classic + BLE
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_GATTS_ENABLE=y
CONFIG_BT_GATTC_ENABLE=n
CONFIG_BT_BLE_50_FEATURES_SUPPORTED=y
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y

# BLE connection parameters
CONFIG_BT_BLE_MAX_CONN=1
CONFIG_BT_GATTS_SEND_SERVICE_CHANGE_MODE=1

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_FREERTOS_IDLE_TIME_BEFORE_SLEEP=3

# I2C
CONFIG_I2C_ENABLE_DEBUG_LOG=n

# SPIFFS
CONFIG_SPIFFS_MAX_PARTITIONS=1
CONFIG_SPIFFS_USE_MAGIC=y

# FAT / SD
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# NVS
CONFIG_NVS_ASSERT_ERROR_CHECK=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_LOG_COLORS=y

# Power management
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y

# OTA
CONFIG_OTA_ALLOW_HTTP=n

# Partition table (custom)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Stack sizes
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Compiler — treat warnings as errors in production
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_WARNINGS_AS_ERRORS=y
